[
  {
    "id": "1",
    "title": "Booki",
    "description": "Le projet Booki consistait à créer une page de réservation de logements et d’activités avec HTML et CSS, en mettant l'accent sur le responsive design. La principale difficulté a été d’adapter le design aux différentes tailles d’écran, ce que j’ai résolu en utilisant des media queries. Ce projet m’a permis de renforcer mes compétences en HTML, CSS et responsive design.",
    "thumbnail": "projects/Booki.png",
    "deployed": "https://adminnono.github.io/booki/",
    "github": "https://github.com/adminnono/adminnono.github.io/tree/main/booki",
    "date": "Avril 2024"
  },
  {
    "id": "2",
    "title": "Resto",
    "description": "Le projet Resto consistait à intégrer une maquette de restaurant avec les langages HTML et Sass, un framework de CSS. Ce projet m'a permis de renforcer mes connaissances des langages HTML et css. Je suis motivé de développer mes connaissances de jour en jour.",
    "thumbnail": "projects/Resto.png",
    "deployed": "https://adminnono.github.io/resto/",
    "github": "https://github.com/adminnono/adminnono.github.io/tree/main/resto",
    "date": "Mai 2024"
  },
  {
    "id": "3",
    "title": "La montagne",
    "description": "Le projet Montagne consistait à intégrer une maquette de site de randonnées en montagne avec les langages HTML et Sass, un framework de CSS. Ce projet m'a permis de renforcer mes connaissances des langages HTML et Sass. Je suis motivé de développer mes connaissances de jour en jour.",
    "thumbnail": "projects/montagne.png",
    "deployed": "https://adminnono.github.io/montagne",
    "github": "https://github.com/adminnono/adminnono.github.io/tree/main/montagne",
    "date": "Mai 2024"
  },
  {
    "id": "4",
    "title": "Nina Carducci",
    "description": "Le projet Nina Carducci consiste à travailler sur l’accessibilité et l’optimisation du SEO du site. Il n'y avait pas vraiment de difficultés pour ce projets. Grâce à ce projet, j'ai développé des compétences en SEO et en accessibilité avec des outils performants comme lighthouse ou encore Wave ",
    "thumbnail": "projects/Nina Carducci.png",
    "github": "https://github.com/adminnono/adminnono.github.io/tree/main/nina-carducci",
    "deployed": "https://adminnono.github.io/nina-carducci/",
    "date": "Juillet 2024"
  },
  {
    "id": "5",
    "title": "Gaming Campus",
    "description": "Dans le cadre du projet Gaming Campus, j'ai créé une page web responsive en HTML et CSS à partir d'une maquette. J'ai utilisé Flexbox et Grid pour organiser le contenu de manière esthétique et adaptée aux différents écrans. Ce projet m'a permis d'apprendre les bases du HTML/CSS et les principes du design responsive.",
    "thumbnail": "projects/GamingCampus.png",
    "deployed": "https://adminnono.github.io/gaming-campus/",
    "github": "https://github.com/adminnono/adminnono.github.io/tree/main/gaming-campus",
    "date": "Décembre 2023"
  },
  {
    "id": "6",
    "title": "L'agence immobilière",
    "description": "Il s'agit d'un projet fictif d'agence immobilière basée à Bordeaux. Le site est conçu en HTML et CSS avec le framework responsive Bootstrap. Il propose des pages de listing avec filtres pour les différents types de biens : appartements, villas et penthouses. Un formulaire de contact permet aux utilisateurs de nous écrire. Une carte Google Maps intégrée affiche l’emplacement de l’agence.",
    "thumbnail": "projects/immobilier.png",
    "deployed": "https://adminnono.github.io/Agence%20Bordelaise/",
    "github": "https://github.com/adminnono/adminnono.github.io/tree/main/Agence%20Bordelaise",
    "date": "Janvier 2024"
  },
  {
    "id": "7",
    "title": "Kasa",
    "description": "Projet Kasa : application de location de logements avec gestion des favoris. Utilisation de React pour gérer les états et la navigation. Compétences développées : React, JavaScript, SCSS, intégration d'API.",
    "thumbnail": "projects/Kasa.png",
    "github": "https://github.com/adminnono/Projet-Kasa-Arnaud-",
    "deployed": "https://projet-kasa-arnaud.vercel.app/",
    "date": "Août & Septembre 2024"
  },
  {
    "id": "8",
    "title": "Agence Banana Design",
    "description": "Site WordPress pour Banana Design avec Elementor, mettant en avant les services de design graphique. Optimisation du design et de l’expérience utilisateur avec des animations interactives.",
    "thumbnail": "projects/bananadesign.png",
    "github": "https://github.com/adminnono/banana_design",
    "deployed": "https://openclassrooms-student-center.github.io/8266636-Creez-votre-premier-site-avec-wordpress/",
    "date": "Novembre 2024"
  },
  {
    "id": "9",
    "title": "L'EPY Association",
    "description": "Refonte du site vitrine du Co-Working associatif de Saint-Symphorien sous WordPress avec Divi. Navigation fluide, accès rapide aux réservations, optimisé pour l’ergonomie et la performance.",
    "thumbnail": "projects/lepy.png",
    "github": "",
    "deployed": "https://lepy-asso.fr/",
    "date": "Mars & Mai 2024"
  },
  {
    "id": "10",
    "title": "Erasmus House",
    "description": "Réalisation du site e-commerce Erasmus House (co-living étudiant) sous WordPress avec WooCommerce et Divi. Réservations en ligne, interface moderne, optimisée mobile et SEO.",
    "thumbnail": "projects/erasmushouse.png",
    "github": "",
    "deployed": "https://erasmushouse.eu/",
    "date": "Août & Septembre 2024"
  },
  {
    "id": "11",
    "title": "Apex Soutien Scolaire",
    "description": "Site WordPress pour Apex Soutien Scolaire, réalisé sous Divi avec intégration Billet Web pour la réservation en ligne de stages. Utilisation de l’API pour une gestion fluide des réservations.",
    "thumbnail": "projects/apex.png",
    "github": "",
    "deployed": "https://apexrouen.fr/",
    "date": "Novembre 2024"
  },
  {
    "id": "12",
    "title": "La Plage Française",
    "description": "Site e-commerce WordPress pour La Plage Française (raquettes de plage made in France). Réalisation sous Divi avec WooCommerce, design épuré, navigation fluide, optimisé pour mobile et SEO.",
    "thumbnail": "projects/laplagefrancaise.png",
    "github": "",
    "deployed": "https://laplagefrancaise.fr/",
    "date": "Octobre 2024"
  },
  {
    "id": "13",
    "title": "Yvon Mau Grands Crus",
    "description": "Création d’un site one-page WordPress sous Divi pour Yvon Mau Grands Crus (groupe Freixenet). Objectif : refléter l’image haut de gamme de la marque à travers un design élégant et une navigation fluide.",
    "thumbnail": "projects/yvonmaugrandscrus.png",
    "github": "",
    "deployed": "https://ymgc.fr/",
    "date": "Juin 2024"
  },
  {
    "id": "14",
    "title": "Alegriaperou",
    "description": "J'ai conçu Alegriaperou, un site vitrine WordPress pour une association humanitaire pour les enfants du Pérou",
    "thumbnail": "projects/alegria.png",
    "github": "",
    "deployed": "https://alegriaperou.fr/",
    "date": "Octobre 2024"
  }
]
